; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	image1 - mode
	thermograph0 - mode
	thermograph2 - mode
	Star2 - direction
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Planet21 - direction
	Phenomenon22 - direction
	Planet23 - direction
	Phenomenon24 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet23)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star0)
	(supports instrument6 image1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet23)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet9)
)
(:goal (and
	(pointing satellite2 Planet23)
	(pointing satellite4 Phenomenon17)
	(have_image Phenomenon4 thermograph0)
	(have_image Planet5 image1)
	(have_image Phenomenon6 image1)
	(have_image Planet8 image1)
	(have_image Planet9 thermograph2)
	(have_image Star10 thermograph2)
	(have_image Phenomenon11 thermograph0)
	(have_image Star13 thermograph2)
	(have_image Star14 thermograph2)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 image1)
	(have_image Phenomenon19 thermograph2)
	(have_image Planet20 image1)
	(have_image Planet21 image1)
	(have_image Phenomenon22 thermograph2)
	(have_image Planet23 thermograph0)
	(have_image Phenomenon24 thermograph2)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 20
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 20
3. (turn_to satellite4 groundstation3 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 groundstation3)
   goals met: 0 of 20
4. (calibrate satellite4 instrument7 groundstation3)
   added: (calibrated instrument7)
   goals met: 0 of 20
5. (turn_to satellite4 phenomenon11 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 20
6. (take_image satellite4 phenomenon11 instrument7 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 1 of 20
7. (turn_to satellite4 phenomenon15 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon15)
   goals met: 1 of 20
8. (take_image satellite4 phenomenon15 instrument7 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 2 of 20
9. (turn_to satellite4 phenomenon17 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon17)
   goals met: 3 of 20
10. (take_image satellite4 phenomenon17 instrument7 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 4 of 20
11. (turn_to satellite2 planet23 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet23)
   goals met: 5 of 20
12. (turn_to satellite0 groundstation3 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation3)
   goals met: 5 of 20
13. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 5 of 20
14. (turn_to satellite0 phenomenon6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 20
15. (take_image satellite0 phenomenon6 instrument0 image1)
   added: (have_image phenomenon6 image1)
   goals met: 6 of 20
16. (turn_to satellite0 planet18 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet18)
   goals met: 6 of 20
17. (take_image satellite0 planet18 instrument0 image1)
   added: (have_image planet18 image1)
   goals met: 7 of 20
18. (turn_to satellite0 planet20 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet20)
   goals met: 7 of 20
19. (take_image satellite0 planet20 instrument0 image1)
   added: (have_image planet20 image1)
   goals met: 8 of 20
20. (turn_to satellite0 planet21 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 planet21)
   goals met: 8 of 20
21. (take_image satellite0 planet21 instrument0 image1)
   added: (have_image planet21 image1)
   goals met: 9 of 20
22. (turn_to satellite0 planet5 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 planet5)
   goals met: 9 of 20
23. (take_image satellite0 planet5 instrument0 image1)
   added: (have_image planet5 image1)
   goals met: 10 of 20
24. (turn_to satellite0 planet8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet8)
   goals met: 10 of 20
25. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 11 of 20
26. (turn_to satellite4 phenomenon19 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon19)
   goals met: 10 of 20
27. (take_image satellite4 phenomenon19 instrument7 thermograph2)
   added: (have_image phenomenon19 thermograph2)
   goals met: 11 of 20
28. (turn_to satellite4 phenomenon17 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 phenomenon17)
   goals met: 12 of 20
29. (turn_to satellite4 phenomenon22 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon22)
   goals met: 11 of 20
30. (take_image satellite4 phenomenon22 instrument7 thermograph2)
   added: (have_image phenomenon22 thermograph2)
   goals met: 12 of 20
31. (turn_to satellite4 phenomenon17 phenomenon22)
   deleted: (pointing satellite4 phenomenon22)
   added: (pointing satellite4 phenomenon17)
   goals met: 13 of 20
32. (turn_to satellite4 phenomenon24 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon24)
   goals met: 12 of 20
33. (take_image satellite4 phenomenon24 instrument7 thermograph2)
   added: (have_image phenomenon24 thermograph2)
   goals met: 13 of 20
34. (turn_to satellite4 phenomenon17 phenomenon24)
   deleted: (pointing satellite4 phenomenon24)
   added: (pointing satellite4 phenomenon17)
   goals met: 14 of 20
35. (turn_to satellite4 phenomenon4 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon4)
   goals met: 13 of 20
36. (take_image satellite4 phenomenon4 instrument7 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   goals met: 14 of 20
37. (turn_to satellite4 phenomenon17 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 phenomenon17)
   goals met: 15 of 20
38. (turn_to satellite0 planet23 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet23)
   goals met: 15 of 20
39. (take_image satellite0 planet23 instrument0 thermograph0)
   added: (have_image planet23 thermograph0)
   goals met: 16 of 20
40. (turn_to satellite4 planet9 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 planet9)
   goals met: 15 of 20
41. (take_image satellite4 planet9 instrument7 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 16 of 20
42. (turn_to satellite4 phenomenon17 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 phenomenon17)
   goals met: 17 of 20
43. (turn_to satellite0 star10 planet23)
   deleted: (pointing satellite0 planet23)
   added: (pointing satellite0 star10)
   goals met: 17 of 20
44. (take_image satellite0 star10 instrument0 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 18 of 20
45. (turn_to satellite4 star13 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 star13)
   goals met: 17 of 20
46. (take_image satellite4 star13 instrument7 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 18 of 20
47. (turn_to satellite4 phenomenon17 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 phenomenon17)
   goals met: 19 of 20
48. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 19 of 20
49. (take_image satellite0 star14 instrument0 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 20 of 20
